#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.conquer-vpc: Reading...
data.aws_iam_policy_document.assume_eks_role: Reading...
data.aws_caller_identity.current: Reading...
aws_eip.vpc_eip["eu-north-1a"]: Refreshing state... [id=eipalloc-07b78c52cbc0fe9e2]
data.aws_iam_policy_document.assume_eks-worker_role: Reading...
aws_eip.vpc_eip["eu-north-1b"]: Refreshing state... [id=eipalloc-06682dc7251af3e47]
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
aws_iam_role.eks_role: Refreshing state... [id=dev-conquer-eks-role]
data.aws_caller_identity.current: Read complete after 0s [id=014630368052]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=dev-conquer-eks-role-20231104055838836900000001]
data.aws_vpc.conquer-vpc: Read complete after 1s [id=vpc-080a377054fdb71a7]
aws_route_table.private_subnet_rt["eu-north-1b"]: Refreshing state... [id=rtb-0b45481c9858127a4]
aws_subnet.eks_subnets_public["eu-north-1a"]: Refreshing state... [id=subnet-0b7073fa1c9a38bc5]
aws_subnet.eks_subnets_public["eu-north-1b"]: Refreshing state... [id=subnet-0789881a8bc072329]
aws_route_table.private_subnet_rt["eu-north-1a"]: Refreshing state... [id=rtb-0eb3e772e84e934fa]
aws_subnet.eks_subnets_private["eu-north-1b"]: Refreshing state... [id=subnet-0660b00926dcb92be]
aws_subnet.eks_subnets_private["eu-north-1a"]: Refreshing state... [id=subnet-0af488b51b8ca7e3f]
aws_nat_gateway.nat_gw["eu-north-1a"]: Refreshing state... [id=nat-0185cb01e709d0c91]
aws_nat_gateway.nat_gw["eu-north-1b"]: Refreshing state... [id=nat-0b7b1c4dd725bfd2f]
aws_route_table_association.private_subnet_rt_association["eu-north-1b"]: Refreshing state... [id=rtbassoc-03445c1568d978724]
aws_route_table_association.private_subnet_rt_association["eu-north-1a"]: Refreshing state... [id=rtbassoc-040954bac360541bf]
aws_eks_cluster.eks: Refreshing state... [id=dev-conquer-cluster]
aws_route.nat_access["eu-north-1b"]: Refreshing state... [id=r-rtb-0b45481c9858127a41080289494]
aws_route.nat_access["eu-north-1a"]: Refreshing state... [id=r-rtb-0eb3e772e84e934fa1080289494]
data.tls_certificate.eks: Reading...
aws_iam_role.AmazonEKS_EBS_CSI_DriverRole: Refreshing state... [id=AmazonEKS_EBS_CSI_DriverRole]
aws_eks_addon.example: Refreshing state... [id=dev-conquer-cluster:vpc-cni]
aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy-attachment: Refreshing state... [id=AmazonEKS_EBS_CSI_DriverRole-20231104060651583900000006]
data.tls_certificate.eks: Read complete after 1s [id=5007ea61dfb4fcd4db18c0c232d56bef3b07d3dc]
aws_iam_openid_connect_provider.eks-idp: Refreshing state... [id=arn:aws:iam::014630368052:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/EF5DE76B70F5A482EDA9FB114339BF74]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_addon.aws-ebs-csi-driver will be created
  + resource "aws_eks_addon" "aws-ebs-csi-driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-conquer-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + service_account_role_arn    = "arn:aws:iam::014630368052:role/AmazonEKS_EBS_CSI_DriverRole"
      + tags_all                    = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_eks_node_group.node-group["eu-north-1a"] will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-conquer-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "dev-conquer-node-group-0"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0af488b51b8ca7e3f",
        ]
      + tags_all               = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_eks_node_group.node-group["eu-north-1b"] will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-conquer-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "dev-conquer-node-group-1"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0660b00926dcb92be",
        ]
      + tags_all               = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_role.eks_worker_role will be created
  + resource "aws_iam_role" "eks_worker_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-conquer-eks-worker-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "dev-conquer-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEC2RoleforSSM will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2RoleforSSM" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM"
      + role       = "dev-conquer-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "dev-conquer-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "dev-conquer-eks-worker-role"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @carlosgit2016, Action: `pull_request`, Working Directory: ``, Workflow: `create-ephemeral-resources`*